**Задача 1**

Напишите две функции. Первая функция заполняет массив случайными значениями, вторая функция выводит массив на экран

In [98]:
import numpy as np
import random

In [99]:
def fill(a):
    n = input() #number of figures
    a = np.random.randint(0, 100, int(n))
    return a

In [100]:
def Print():
    arr = np.array([])
    arr = fill(arr)
    print(arr)

In [101]:
Print()

10
[28 63 49 40 92 96 66 94 29 24]

**Задача 2**

In [102]:
import pandas as pd

In [103]:
df = pd.read_csv("example.csv", delimiter = ';')

In [105]:
df.head()

,student,birth,subject1,teacher1,date1,mark1,subject2,teacher2,date2,mark2,...,date3,mark3,subject4,teacher4,date4,mark4,subject5,teacher5,date5,mark5
0,Ivanov Ivan Ivanovich,05.09.1999,Math,Huilo M.V.,30.05.2022,5.0,NaN,NaN,NaN,7,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Pchelovodov Maxim Petrovich,29.09.2002,History,Voron A.E.,02.06.2022,3.0,NaN,NaN,NaN,7,...,NaN,6.0,NaN,NaN,NaN,9.0,NaN,NaN,NaN,NaN
2,Alexandrov Makar Urevich,09.02.1999,CS,Slast S.A.,28.06.2022,9.0,NaN,NaN,NaN,4,...,NaN,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.0

In [106]:
def Res(df):
    df2 = df[["mark1", "mark2", "mark3", "mark4", "mark5"]].copy()
    df2["mean"] = df2.mean(axis = 1)
    return pd.concat([df["student"], df2["mean"]], axis = 1)

In [107]:
Res(df)

                       student  mean
0        Ivanov Ivan Ivanovich  6.00
1  Pchelovodov Maxim Petrovich  6.25
2     Alexandrov Makar Urevich  7.00